Core/src/Documents/РС_НалоговыйДокумент/РС_НалоговыйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РС_НалоговыйДокумент</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияУдостоверение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительНеРезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерАвтомобиля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_НД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНД</name>
    <type>
      <types>EnumRef.РС_СтатусыНД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТранспортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиНД</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.РС_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийНД</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АсинхроннаяНД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНД</name>
    <type>
      <types>EnumRef.РС_ТипыНД</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыТранспортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругойТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяДистрибюций</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикТранспортировкиНД</name>
    <type>
      <types>EnumRef.ПлательщикТранспортировкиТН</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНД</name>
    <type>
      <types>EnumRef.РС_НазначенияНД</types>
    </type>
  </attributes>
  <attributes>
    <name>Получен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДляРС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыЭлНакладных</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>INVOICE_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GOODS_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BARCODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_TXT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY_EXT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EXCISE_AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EXCISE_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_TYPE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EXCISE_UNIT_PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШапкаRS</name>
    <attributes>
      <name>ИмяПараметраRS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметраRS</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыОперацийРасходнаяНакладная/ВидыОперацийРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходнаяНакладная</name>
  <enumValues>
    <name>ПродажаПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПереработки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПродажаСотруднику</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/РС_ТипыНД/РС_ТипыНД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_ТипыНД</name>
  <enumValues>
    <name>ВнутреннееПеремещение</name>
    <comment>კოდი 1</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияСТранспортировкой</name>
    <comment>კოდი 2</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияБезТранспортировки</name>
    <comment>კოდი 3</comment>
  </enumValues>
  <enumValues>
    <name>Дистрибуция</name>
    <comment>კოდი 4</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>კოდი 5</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
    <comment>კოდი 6</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/РС_ВидыТранспортировки/РС_ВидыТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_ВидыТранспортировки</name>
  <enumValues>
    <name>Автомобильная</name>
    <comment>(კოდი 1)</comment>
  </enumValues>
  <enumValues>
    <name>Железнодорожная</name>
    <comment>(კოდი 2)</comment>
  </enumValues>
  <enumValues>
    <name>Авиационная</name>
    <comment>(კოდი 3)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(კოდი 4)</comment>
  </enumValues>
  <enumValues>
    <name>Автомобильная_Заграничная</name>
    <comment>(კოდი 6)</comment>
  </enumValues>
  <enumValues>
    <name>Перегрузчик_Автомобильная</name>
    <comment>(კოდი 7)</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/РС_НазначенияНД/РС_НазначенияНД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_НазначенияНД</name>
  <enumValues>
    <name>ДоставкаУслуга</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
    <comment>კოდი 6</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СоответствияНоменклатуры/СоответствияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоответствияНоменклатуры</name>
  <enumValues>
    <name>ПоШтрихкоду</name>
  </enumValues>
  <enumValues>
    <name>ПоАртикулу</name>
  </enumValues>
  <enumValues>
    <name>ПоКоду</name>
  </enumValues>
  <enumValues>
    <name>ПоХарактеристике</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/РС_НалоговыйДокумент/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ДокументыОснования") Тогда
			Для Каждого ДокументОснование Из ДанныеЗаполнения.ДокументыОснования Цикл
				НоваяСтрока = ДокументыОснования.Добавить();
				НоваяСтрока.ДокументОснование = ДокументОснование;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли  Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))Тогда 
		ЗаполнитьДанныеДляОбмена(ДанныеЗаполнения);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отпустил) Тогда
		Отпустил = "";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Получил) Тогда
		Получил = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляОбмена(СсылкаНаДокумент) Экспорт 
	Дата = ТекущаяДата();
	Организация = СсылкаНаДокумент.Организация;
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная") ИЛИ
		 ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			СтруктурнаяЕдиница = СсылкаНаДокумент.СтруктурнаяЕдиница;
		Иначе
			СтруктурнаяЕдиница = СсылкаНаДокумент.СтруктурнаяЕдиницаРезерв;
		КонецЕсли;
		МобильныйСклад = СтруктурнаяЕдиница.МобильныйСклад;//Перем
		Договор = СсылкаНаДокумент.Договор;//Перем
		
		ТипНД 					  = ?((СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения Или
								  	  СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
									  ,Перечисления.РС_ТипыНД.ВнутреннееПеремещение, ?(МобильныйСклад, Перечисления.РС_ТипыНД.Дистрибуция, Перечисления.РС_ТипыНД.РеализацияСТранспортировкой));
		ВидТранспортировки 		  = Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		  = СсылкаНаДокумент.Организация;
		АдресОтправки 			  = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель           = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			  = Договор.Адрес;
		ДатаНачалаТранспортировки = ТекущаяДата();
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийНД			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Договор = СсылкаНаДокумент.Договор;//перем
		
		ТипНД 					= Перечисления.РС_ТипыНД.ВозвратОтПокупателя;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= СсылкаНаДокумент.Контрагент;
		АдресОтправки	 		= Договор.Адрес;		
		ГрузоПолучатель 		= СсылкаНаДокумент.Организация;
		АдресДоставки   		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ТранспортноеСредство 	= Договор.ТранспортноеСредство;
		ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;		
		Водитель			 	= Договор.Водитель;
		НомерУдостоверения   	= Водитель.ИНН;
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийНД			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;

	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		ФактАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы;		
		
		Если СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.МобильныйСклад Тогда
			ТипНД 					= Перечисления.РС_ТипыНД.Дистрибуция;
			ТранспортноеСредство 	= СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= ТранспортноеСредство.ОсновнойВодитель;
			НомерУдостоверения   	= Водитель.ИНН;
		Иначе
			ТипНД 					= Перечисления.РС_ТипыНД.ВнутреннееПеремещение;
		КонецЕсли;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= Организация;
		АдресОтправки	 		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница,				ФактАдрес);
		ГрузоПолучатель 		= Организация;
		АдресДоставки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель,	ФактАдрес);		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийНД			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
		//ВидЦены				= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		
		//ТранспортноеСредство = СсылкаНаДокумент.Договор.ТранспортноеСредство;
		//Водитель			 = СсылкаНаДокумент.Договор.Водитель;
		//НомерУдостоверения   = Водитель.ИНН;
		//ГосНомерАвтомобиля	 = ТранспортноеСредство.Код;

	КонецЕсли;
	
	Если ТипНД = Перечисления.РС_ТипыНД.Аванс Тогда
		НазначениеНД = Перечисления.РС_НазначенияНД.Аванс;
	Иначе
		НазначениеНД = Перечисления.РС_НазначенияНД.ДоставкаУслуга;
	КонецЕсли;	
		

КонецПроцедуры // ()

Функция СформироватьТаблицуЭлНакладных() Экспорт 
	
	Организация_СоответствиеНоменклатур = Организация.СоответствиеНоменклатур;
	ВнутреннееПеремещение				= (ТипНД = Перечисления.РС_ТипыНД.ВнутреннееПеремещение);
	ПредставлениеНоменклатуры			= ?(Организация.ОтправитьПолноеНаименованиеНоменклатуры, "НаименованиеПолное", "Наименование");
	ТоварыЭлНакладных.Очистить();
	
	Для каждого СтрТаб Из Товары  Цикл
		СтрЭлНТаб = ТоварыЭлНакладных.Добавить();
		
		Если Не ЗначениеЗаполнено(СтрТаб.Номенклатура) Тогда 
			Продолжить;
		КонецЕсли;
		//("GOODS"); //GOODS
		
		СтрЭлНТаб.ID       = 0;//СтрТаб.НомерСтроки-1 Паганини
		
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалНаименованияРС") И ЗначениеЗаполнено(СтрТаб.НаименованиеДляРС) Тогда
			СтрЭлНТаб.GOODS_NAME = СтрТаб.НаименованиеДляРС;
		Иначе
			СтрЭлНТаб.GOODS_NAME   = ПредставлениеНоменклатуры(СтрТаб.Номенклатура[ПредставлениеНоменклатуры],СтрТаб.Характеристика,СтрТаб.Партия);
		КонецЕсли;			
		
		СтрЭлНТаб.UNIT_ID    = СтрТаб.ЕдиницаИзмерения.КодДляНалоговой;
		СтрЭлНТаб.UNIT_TXT   = СтрТаб.ЕдиницаИзмерения.Наименование;
		СтрЭлНТаб.QUANTITY   = СтрТаб.Количество;		
		
		СтрЭлНТаб.UNIT_PRICE = СтрТаб.Цена;
		СтрЭлНТаб.AMOUNT     = СтрТаб.Сумма;
		
		Если Организация_СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоАртикулу Тогда 
			СтрЭлНТаб.BARCODE = СтрТаб.Номенклатура.Артикул;
		ИначеЕсли Организация_СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоШтрихкоду Тогда 
			СтрЭлНТаб.BARCODE = СтрТаб.Номенклатура.ОсновнойШтрихКод;
		ИначеЕсли Организация.СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоХарактеристике Тогда
			СтрЭлНТаб.BARCODE = ПолучитьКодХарактеристики(СтрТаб);	
		Иначе
			СтрЭлНТаб.BARCODE = СтрТаб.Номенклатура.Код;
		КонецЕсли;
		
		СтрЭлНТаб.EXCISE_ID     = 0;//Акциз		
		Если ВнутреннееПеремещение Тогда
			СтрТаб.СтавкаНДС = СтрТаб.Номенклатура.СтавкаНДС;
		КонецЕсли;
		Если СтрТаб.СтавкаНДС.НеОблагается Тогда
			СтрЭлНТаб.VAT_TYPE = 2;
		ИначеЕсли СтрТаб.СтавкаНДС.Ставка = 0 Тогда
			СтрЭлНТаб.VAT_TYPE = 1;
		ИначеЕсли СтрТаб.СтавкаНДС.Ставка = 18 Тогда
			СтрЭлНТаб.VAT_TYPE = 0;
		КонецЕсли;
		
		СтрЭлНТаб.VAT_AMOUNT = СтрТаб.СуммаНДС;
		//СтрЭлНТаб.QUANTITY_EXT =  СтрТаб.Количество;
		
	КонецЦикла;
	

КонецФункции

//ДД
Функция ПолучитьКодХарактеристики(Стр)
	
	Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
		Возврат Стр.Характеристика.Код;
	Иначе
		Возврат Стр.Номенклатура.Код;
	КонецЕсли;	
	
КонецФункции

Функция СформироватьТаблицуШапкаRS() Экспорт 
	
	ШапкаRS.Очистить();
	
	//ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "ID"; 
	СтрШапкаRS.ЗначениеПараметраRS = ID_НД; 
	
	//ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "INV_SERIE"; 
	СтрШапкаRS.ЗначениеПараметраRS = "";
	
	//ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "INV_NUMBER"; 
	СтрШапкаRS.ЗначениеПараметраRS = "";
	
	//INV_CATEGORY
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "INV_CATEGORY"; 
	СтрШапкаRS.ЗначениеПараметраRS = ПолучитьКодКатегории(); 

	//TYPE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "INV_TYPE"; 
	СтрШапкаRS.ЗначениеПараметраRS = ПолучитьКодТипа(); 
	
	//SELLER_ACTION
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "SELLER_ACTION"; 
	СтрШапкаRS.ЗначениеПараметраRS = 0; 
	
	//BUYER_ACTION
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS =  "BUYER_ACTION"; 
	СтрШапкаRS.ЗначениеПараметраRS = 0;
	
	//OPERATION_DATE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS =  "OPERATION_DATE"; 
	СтрШапкаRS.ЗначениеПараметраRS = Формат(ДатаАктивации, "ДФ='dd-MM-yyyy  hh:mm:ss'");	   
	
	//TRANS_START_DATE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS =  "TRANS_START_DATE"; 
	СтрШапкаRS.ЗначениеПараметраRS = Формат(ДатаНачалаТранспортировки, "ДФ='dd-MM-yyyy  hh:mm:ss'");
	
	//CORRECT_REASON_ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS =  "CORRECT_REASON_ID"; 
	СтрШапкаRS.ЗначениеПараметраRS = "";
	
	//TIN_SELLER
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TIN_SELLER"; 
	СтрШапкаRS.ЗначениеПараметраRS =  СокрЛП(ГрузоОтправитель.ИНН); 
	
	//TIN_BUYER
	Если ТипНД = Перечисления.РС_ТипыНД.ВнутреннееПеремещение Тогда 		
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TIN_BUYER"; 
		СтрШапкаRS.ЗначениеПараметраRS =  ""; 	
	Иначе
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TIN_BUYER"; 
		СтрШапкаRS.ЗначениеПараметраRS =  СокрЛП(ГрузоПолучатель.ИНН);
	КонецЕсли;
	
	//FOREIGN_BUYER
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "FOREIGN_BUYER"; 
	СтрШапкаRS.ЗначениеПараметраRS =  "false"; 
	
	//AMOUNT_FULL
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "AMOUNT_FULL"; 
	СтрШапкаRS.ЗначениеПараметраRS = Товары.Итог("Сумма");
	
	//AMOUNT_EXCISE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "AMOUNT_EXCISE"; 
	СтрШапкаRS.ЗначениеПараметраRS = 0; 
	
	//AMOUNT_VAT
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "AMOUNT_VAT"; 
	СтрШапкаRS.ЗначениеПараметраRS = Товары.Итог("СуммаНДС"); 
	
	//TRANS_START_ADDRESS
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_START_ADDRESS"; 
	СтрШапкаRS.ЗначениеПараметраRS = АдресОтправки; 
	
	//TRANS_END_ADDRESS
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_END_ADDRESS"; 
	СтрШапкаRS.ЗначениеПараметраRS = АдресДоставки;  
	
	//TRANS_START_ADDRESS_NO
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_START_ADDRESS_NO"; 
	СтрШапкаRS.ЗначениеПараметраRS = ""; 
	
	//TRANS_END_ADDRESS_NO
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_END_ADDRESS_NO"; 
	СтрШапкаRS.ЗначениеПараметраRS = ""; 
	
	//TRANS_TYPE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_TYPE"; 
	СтрШапкаRS.ЗначениеПараметраRS = 1;
	
	//TRANS_TYPE_TXT
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_TYPE_TXT"; 
	СтрШапкаRS.ЗначениеПараметраRS = ""; 
	
	//TRANS_COMPANY_TIN
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_COMPANY_TIN"; 
	СтрШапкаRS.ЗначениеПараметраRS = ""; 
	
	//TRANS_DRIVER_TIN
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_DRIVER_TIN"; 
	СтрШапкаRS.ЗначениеПараметраRS = НомерУдостоверения; 
	
	//TRANS_DRIVER_NAME
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_DRIVER_NAME"; 
	СтрШапкаRS.ЗначениеПараметраRS = Водитель;
	
	//TRANS_DRIVER_FOREIGN
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_DRIVER_FOREIGN"; 
	СтрШапкаRS.ЗначениеПараметраRS = "false";
	
	//TRANS_DRIVER_COUNTRY
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_DRIVER_COUNTRY"; 
	СтрШапкаRS.ЗначениеПараметраRS = "";
	
	//TRANS_CAR_MODEL
	СтрШапкаRS = ШапкаRS.Добавить();            
	СтрШапкаRS.ИмяПараметраRS = "TRANS_CAR_MODEL"; 
	СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ТранспортноеСредство),ТранспортноеСредство.Марка,"");
	
	//TRANS_CAR_NO
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_CAR_NO"; 
	СтрШапкаRS.ЗначениеПараметраRS = ГосНомерАвтомобиля;
	
	//TRANS_TRAILER_NO
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_TRAILER_NO"; 
	СтрШапкаRS.ЗначениеПараметраRS = Прицеп;
	
	//TRANS_COST
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_COST"; 
	СтрШапкаRS.ЗначениеПараметраRS = "";
	
	//TRANS_COST_PAYER
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_COST_PAYER"; 
	СтрШапкаRS.ЗначениеПараметраRS = 2;
	
	//INV_COMMENT
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "INV_COMMENT"; 
	СтрШапкаRS.ЗначениеПараметраRS = КомментарийНД;
	
	//PREV_CORRECTION_ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "PREV_CORRECTION_ID"; 
	СтрШапкаRS.ЗначениеПараметраRS = 0;
	
	//TEMPLATE_NAME
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TEMPLATE_NAME"; 
	СтрШапкаRS.ЗначениеПараметраRS = "";
	
	//USER_ROLE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "USER_ROLE"; 
	СтрШапкаRS.ЗначениеПараметраRS = 1;
	
	
КонецФункции

//Возвращает строковое представление номенклатуры с характеристикой для отображения в сообщениях
//Параметры
// 		НоменклатураПредставление - строковое предствление номенклатуры или ссылка на элемент справочника "Номенклатура"
// 		ХарактеристикаПредставление - строковое предствление характеристики или ссылка на элемент справочника "Номенклатура"
Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика, Серия) Экспорт

	СтрПредставление = СокрЛП(Номенклатура);

	Если ЗначениеЗаполнено(Характеристика)Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Характеристика.Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Серия) Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Серия.Наименование);
	КонецЕсли;

	Возврат СтрПредставление;

КонецФункции

Функция ПолучитьКодКатегории()
	
	Если НазначениеНД = Перечисления.РС_НазначенияНД.ДоставкаУслуга Тогда
		Возврат 1;//доставка/услуга
	Иначе
		Возврат 4;//аванс
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьКодТипа()
	
	Если ТипНД = Перечисления.РС_ТипыНД.ВнутреннееПеремещение Тогда
		Возврат 1;
	ИначеЕсли ТипНД = Перечисления.РС_ТипыНД.РеализацияСТранспортировкой Тогда
		Возврат 2;
	ИначеЕсли ТипНД = Перечисления.РС_ТипыНД.РеализацияБезТранспортировки Тогда
		Возврат 3;
	ИначеЕсли ТипНД = Перечисления.РС_ТипыНД.Дистрибуция Тогда
		Возврат 4;
	ИначеЕсли ТипНД = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
		Возврат 5;
	ИначеЕсли ТипНД = Перечисления.РС_ТипыНД.Аванс Тогда
		Возврат 6;
	КонецЕсли;	
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	ID_НД 		= 0;
	СтатусНД 	= Неопределено;
	НомерНД  	= "";
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ДокументыОснования.Количество() > 0 Тогда
		ЗаписыватьДокумент = Ложь;
		Если НЕ ID_НД = Ссылка.ID_НД Тогда
			ЗаписыватьДокумент = Истина;
		КонецЕсли;
		Если НЕ НомерНД = Ссылка.НомерНД Тогда
			ЗаписыватьДокумент = Истина;
		КонецЕсли;
		Если ЗаписыватьДокумент Тогда
			ДокументОбъект = ДокументыОснования[0].ДокументОснование.ПолучитьОбъект();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.НомерНД = НомерНД;
			ДокументОбъект.IDНД	= Формат(ID_НД, "ЧН=' '; ЧГ=0");
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТипНД = Перечисления.РС_ТипыНД.Дистрибуция Тогда
		НакладнаяДистрибюций = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
